/* The string for canceling a map editing function. */
"CancelKey" = "Canslo";

/* The title text in the alert when cancelling map editing. */
"CancelEditAlertTitleKey" = "Ydych chi'n siŵr eich bod am ganslo?";

/* The message text in the alert when cancelling map editing (no points created). */
"CancelEditAlertMessageKey" = "Chaiff eich newidiadau ddim eu cadw.";

/* The message text in the alert when cancelling map editing (points created). */
"CancelEditAlertPointsCreatedMessageKey" = "Chaiff y gwrthrych rydych chi wedi'i greu ddim ei gadw.";

/* The text of the alert action when discarding editing changes. */
"DiscardChangesTitleKey" = "Gwaredu Newidiadau";

/* The text of the alert action when the users cancels editing an address field */
"CancelEditingTitleKey" = "Canslo Golygu";

/* The title text in the alert when entering an address that is invalid. */
"InvalidAddressTitleKey" = "Cyfeiriad Annilys";

/* The message in the invalid address alert when an address is required. */
"AddressRequiredMessage" = "Rhaid rhoi cyfeiriad ar gyfer y pwynt";

/* The title text in the alert when inputting empty text into a new address cell. */
"NoAddedLocationTitleKey" = "Dydych chi ddim wedi ychwanegu lleoliad ar gyfer y pwynt hwn";

/* The message text in the alert when inputting empty text into a new address cell. */
"NoAddedLocationMessageKey" = "Fydd pwynt newydd ddim yn cael ei ychwanegu";

/* The text of the alert action to continuing editing. */
"ContinueEditingTitleKey" = "Bwrw ymlaen â'r Golygu";

/* The title text in the alert when tapping an invalid point when trying to delete. */
"DeletePointErrorTitleKey" = "Dewiswch y pwynt rydych chi am ei ddileu.";

/* The title text in the alert when trying to delete an editing point on the map, but no editing points exist. */
"EmptyDeletePointErrorTitleKey" = "Does dim pwyntiau i'w dileu.";

/* The text of the alert action to dismiss the alert. */
"OKTitleKey" = "Iawn";

/* The title text of the alert when deleting all stored editing points. */
"ClearAllPointsTitleKey" = "Ydych chi'n siŵr eich bod am glirio pob pwynt?";

/* The text of the alert action to reject the alert prompt. */
"NoTitleKey" = "Na";

/* The text of the alert action to accept the alert prompt */
"YesTitleKey" = "Iawn";

/* The title text of the alert when switching editing geometries to a point. */
"ChangeGeometryPointTitleKey" = "Ydych chi am newid i bwynt?";

/* The title text of the alert when switching editing geometries to a polyline. */
"ChangeGeometryPolylineTitleKey" = "Ydych chi am newid i bolylinell?";

/* The title text of the alert when switching editing geometries to a polygon. */
"ChangeGeometryPolygonTitleKey" = "Ydych chi am newid i bolygon?";

/* The message text in the alert when switching to a multipoint geometry. */
"ChangeGeometryToMultiPointMessageKey" = "Fydd y pwyntiau rydych chi wedi'u hychwanegu ddim yn cael eu newid, a gallwch barhau i greu'r gwrthrych.";

/* The message text in the alert when switching to a point geometry. */
"ChangeGeometryToPointMessageKey" = "Bydd yr holl bwyntiau rydych chi wedi'u hychwanegu yn cael eu dileu.";

/* The title text of the alert when deleting a point of the editing geometry. */
"DeletePointTitleKey" = "Ydych chi'n siŵr eich bod am ddileu'r pwynt hwn?";

/* The title of the button to save the editing geometry. */
"SaveButtonTitleKey" = "Cadw";

/* The title of the button to filter the geometry. */
"FilterTitleKey" = "Hidlo";

/* The status text of the User Location TableViewCell in the suggesiton panel. */
"CurrentLocationKey" = "Lleoliad Presennol";

/* The footnote text of the TableViewCell in the suggesiton panel if no suggestions are returned. */
"NoSuggestionsFoundKey" = "Heb ddod o hyd i awgrymiadau";

/* The text of the editingPanel Address textField. */
"AddressKey" = "Cyfeiriad";

/* The title of the button to delete all stored editing points. */
"ClearAllKey" = "Clirio Pob Un";

/* The text of the Toast Message after creating an object. */
"CreatedObjectToastMessage" = "Wedi llwyddo i greu %@";

/* The placeholder text of the Searchbar */
"SearchKey" = "Chwilio";

/* The placeholder text to add a new geospatial point by tapping on the map or typing an address. */
"AddNewPointKey" = "Ychwanegu Pwynt Newydd";

/* The title of the cell to pick from available map types. */
"BasemapKey" = "Map sylfaenol";

/* The title for the standard map type. */
"StandardKey" = "Safonol";

/* The title for the hybrid map type. */
"HybridKey" = "Hybrid";

/* The title for the hybrid flyover map type. */
"HybridFlyoverKey" = "Hybrid gyda Data Hofran";

/* The title for the muted standard map type. */
"MutedStandardKey" = "Safonol Wedi Tewi";

/* The title for the satellite map type. */
"SatelliteKey" = "Lloeren";

/* The title for the satellite flyover map type. */
"SatelliteFlyoverKey" = "Lloeren gyda Data Hofran";

/* The text of add location button for location form cell. */
"AddLocationButtonKey" = "Ychwanegu Lleoliad";

